{
  "posts": [
    {
      "title": "Welcome!",
      "description": "Welcome to my new blog!",
      "read-time": "1",
      "content": "Hello everyone! I'm glad to have you visiting my blog! From time to time I'll post some tips or a project idea or something interesting! \u003ch2\u003eWho am I?\u003c/h2\u003e \u003cp\u003e I'm Hamd, a twelve year old who works in Swift, Python, Web Dev, Data Science, and more! I love exploring new things and playing around with AI! You can learn more about me \u003ca href=\"about.html\"\u003ehere\u003c/a\u003e \u003c/p\u003e \u003ch2\u003eWhat will I write about?\u003c/h2\u003e A lot! Sometimes it'll be tutorials, maybe a quick tip, maybe I might just tell you something I stumbled across! Soon, you'll be able to find a lot on this blog :) \u003cp\u003eThanks again for visiting my blog, and I hope you'll learn something new here!",
      "date": "18/08/2022",
      "id": 1
    },
    {
      "title": "Python Lambdas",
      "description": "How inline, temporary function work in Python and how they are used",
      "read-time": "3",
      "content": "\u003cp\u003e Methods are an essential part of programming, and that's no different in Python. But sometimes, there are situations in which it'll be a hassle to define a whole function, or you'll only use the method once and it will make the file unnecessarily large. This is where \u003cb\u003elambdas\u003c/b\u003e become useful!\u003c/p\u003e \u003cp\u003eLambdas are a quick one-line way to define a method, and they are \u003cem\u003eanonymous\u003c/em\u003e, which means they do not have a name, unlike a typical function.  Let's see how they look:  \u003cdiv class='code-box'\u003e\u003cspan class='keyname'\u003emy_lambda\u003c/span\u003e = \u003cspan class='keyword'\u003elambda\u003c/span\u003e \u003cspan class='variable'\u003earg1, arg2: arg1+arg2\u003c/span\u003e \u003cbr\u003e\u003cbr\u003e \u003cspan class='keyname'\u003eprint\u003c/span\u003e(\u003cspan class='keyname'\u003emy_lambda\u003c/span\u003e(\u003cspan class='variable'\u003e2\u003c/span\u003e, \u003cspan class='variable'\u003e3\u003c/span\u003e))\u003c/div\u003e \u003cp\u003eWe are creating a variable called \u003cspan class='codeline'\u003emy_lambda\u003c/span\u003e that holds the lambda. When we call it (\u003cspan class="codeline"\u003emy_lambda()\u003c/span\u003e) we execute the lambda method, which adds two values together. Now let's look into the syntax of lambdas. \u003c/p\u003e \u003cp\u003eFirst we use the \u003cspan class='codeline'\u003elambda\u003c/span\u003e keyword and then provide parameters. We list them the same way as a normal method: comma separated. Optionally, you can provide a default value by putting an equal symbol then the default value, just like a normal function. After providing the arguments, put a colon, and then the return value. In the code block above, we added the two parameters together. \u003ch2\u003eUse Cases\u003c/h2\u003e \u003cp\u003eWhen would you use a lambda?\u003c/p\u003e \u003cp\u003eOne of the ways I use a lambda quite often is when I want to trigger another function. Say, for example, you had a tkinter button which should trigger the method \u003cspan class='codeline'\u003emy_function(a, b)\u003c/span\u003e. I can't provide parameters to the method in the button trigger, so I would use a simple lambda: \u003c/p\u003e \u003cdiv class='code-box'\u003e\u003cspan class='keyname'\u003ecommand\u003c/span\u003e=\u003cspan class='keyword'\u003elambda\u003c/span\u003e: \u003cspan class='keyname'\u003emy_function\u003c/span\u003e(1, 2) \u003c/div\u003e \u003cp\u003eIn this scenario, I only want to use this lambda once, and it also allows me to provide arguments to my method, so it is a great and simple solution!\u003c/p\u003e \u003cp\u003eI hope you learned something new about lambdas today! Thanks for reading :)\u003c/p\u003e",
      "date": "22/08/2023",
      "id": 2
    },
    {
      "title": "Test Post 3",
      "description": "Description of test post 3",
      "read-time": "3",
      "content": "Here is some sample code: \u003cdiv class='code-box'\u003e \u003cspan class='keyword' \u003e var \u003c/span\u003e  \u003cspan class='keyname'\u003e foo \u003c/span\u003e = \u003cspan class='variable'\u003e 12\u003c/span\u003e; \u003cbr\u003e\u003cbr\u003e   \u003cspan class='keyword'\u003e function \u003c/span\u003e \u003cspan class='keyname'\u003ebar\u003c/span\u003e() { \u003cbr\u003e\u003cbr\u003e } \u003c/div\u003e Thanks for reading this test post!",
      "date": "01/01/2024",
      "id": 3
    }      
   ],
  "num": 3
}
